var config = {

	/**
	 * ---------------------------------------------------------
	 * Javascript 语法检测工具
	 * ---------------------------------------------------------
	 * 是否开启jshint， jshint会查找你的js代码中的错误
	 * 参数：
	 *      true 开启
	 *      false 关闭
	 */
	jshint : false,
	/**
	 * ---------------------------------------------------------
	 * CSS 预编译器
	 * ---------------------------------------------------------
	 * 选择使用的CSS预编译器
	 * 参数：
	 *      none 纯css
	 *      less less编译与css
	 *      sass sass编译与css
	 *      less|sass 既有sass也有less，同样也支持CSS
	 */
	cssCompile : "sass|less",
	/**
	 * ---------------------------------------------------------
	 * 开发环境
	 * ---------------------------------------------------------
	 * 开发环境决定着代码的压缩与合并
	 * 参数
	    * development 开发环境， 代码不会压缩， 保留所有注释
	    * production  生产环境， 压缩代码， 移除注释， 根本没法看！！
	 */
	environment : "development",
	/**
	 * ---------------------------------------------------------
	 * 网络代理
	 * ---------------------------------------------------------
	 * BrowserSync 代理配置
	 * 为被代理的服务器网络端口
	 */
	proxy : "localhost:6890",
	/**
	 * ---------------------------------------------------------
	 * 图片压缩等级
	 * ---------------------------------------------------------
	 * 压缩等级为 0 至 7
	 */
	imageLevel : 7


};


module.exports = config;